Revit 2024 API
ReferenceWithContext Methods
The ReferenceWithContext type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetInstanceTransform
 Gets the transform of the instance.
GetReference
 Gets the reference of the geometric object.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ReferenceWithContext Class
Autodesk.Revit.DB Namespace